src/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродуктивнаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Расширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>Расширения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Назначено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Установлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяОперация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяСейчас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расширения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ИнформационныеБазы/Ext/ObjectModule.bsl
Функция Адрес() Экспорт

	Возврат СтрШаблон("http://%1:%2@%3:%4/%5/hs/fastex/", Логин(), Пароль(), АдресПубликации(), ПортПубликации(), ИмяПубликации());

КонецФункции

Функция Логин() Экспорт 
	Возврат Логин;
КонецФункции

Функция Пароль() Экспорт 
	Возврат Пароль;
КонецФункции

Функция АдресПубликации() Экспорт 
	Возврат Компьютер.IP;
КонецФункции

Функция ПортПубликации() Экспорт 
	Возврат ?(ПустаяСтрока(ПортПубликации), "80", ПортПубликации);
КонецФункции

Функция ИмяПубликации() Экспорт 
	Возврат ИмяПубликации;
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если ПустаяСтрока(Версия) Тогда
		Версия = "?";
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанные(Инфо = Неопределено) Экспорт 

	Если Инфо = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура("ПараметрыПреобразованияJSON", Новый Структура("ПрочитатьВСоответствие", Ложь));
		Инфо = КоннекторHTTP.GetJson(Адрес() + "node/info", , ДополнительныеПараметры);
		Если НЕ ТипЗнч(Инфо) = Тип("Структура")  Тогда
			ВызватьИсключение Инфо;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ СокрЛП(Версия) = СокрЛП(Инфо.version) Тогда
		Версия = ?(ПустаяСтрока(Инфо.version), "?", Инфо.version);
	КонецЕсли;
	
	Набор = РегистрыСведений.Расширения.СоздатьНаборЗаписей();
	Набор.Отбор.ИнформационнаяБаза.Установить(Ссылка, Истина);
	
	Для каждого ОписаниеРасширения Из Инфо.extensions Цикл
		
		РасширениеСсылка = Справочники.Расширения.НайтиПоНаименованию(ОписаниеРасширения.Ключ);
		Если РасширениеСсылка.Пустая() Тогда
			РасширениеОбъект = Справочники.Расширения.СоздатьЭлемент();
			РасширениеОбъект.Наименование = ОписаниеРасширения.Ключ;
			РасширениеОбъект.Записать();
			РасширениеСсылка = РасширениеОбъект.Ссылка;
		КонецЕсли;
		
		Запись = Набор.Добавить();
		Запись.Активность = Истина;
		Запись.ИнформационнаяБаза = Ссылка;
		Запись.Расширение = РасширениеСсылка;
		Запись.Версия =  ?(ПустаяСтрока(ОписаниеРасширения.Значение), "?", ОписаниеРасширения.Значение);
		
	КонецЦикла;
	
	//Сортировка для сохранения порядка записей - важно для проверки измененности
	Таблица = Набор.Выгрузить();
	Таблица.Сортировать("Расширение");
	Набор.Загрузить(Таблица);
	
	СодержаниеВерсий = "";
	Если ПроверкаИзмененности.ОбъектИзменен(Набор,,,,СодержаниеВерсий) Тогда
 		Набор.Записать();
	КонецЕсли;
	
	СодержаниеВерсий = "";
	Если ПроверкаИзмененности.ОбъектИзменен(ЭтотОбъект,,,,СодержаниеВерсий) Тогда
		Записать();
	КонецЕсли;
	
	Компьютер.ПолучитьОбъект().ОбновитьДанные(Инфо);
	
КонецПроцедуры
